Tekla.Structures.Drawing.Frame
The Frame class defines a frame that can be given to objects, including texts.
A frame is a box around the object. You can specify the color and shape of the box.

Tekla.Structures.Drawing.Frame.Width
The width of the frame

Tekla.Structures.Drawing.Frame.Height
The height of the frame

Tekla.Structures.Drawing.Frame.Angle
The angle of the frame (compared to X-axis)

Tekla.Structures.Drawing.Frame.InsertionPoint
The InsertionPoint of the frame (CenterPoint)

Tekla.Structures.Drawing.Frame.Type
The frame's type (square, round, dashed...).

Tekla.Structures.Drawing.Frame.Color
The frame's color.
Throws System.ArgumentOutOfRangeException: Thrown when trying to set a non-standard color.

Tekla.Structures.Drawing.Frame.TrueColor
The true color (RGB enabled) of the frame.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.Frame.GetAxisAlignedBoundingBox
Returns the bounding box of the frame in the global axis coordinate system.
Returns: The bounding box of the frame in the global axis coordinate system.

Tekla.Structures.Drawing.Frame.GetObjectAlignedBoundingBox
Returns the bounding box of the frame in the local coordinate system.
Returns: The bounding box of the frame in the local coordinate system.

Tekla.Structures.Drawing.Frame.Initialize
Initializes the standard values for Frame

Tekla.Structures.Drawing.Frame.#ctor(Tekla.Structures.Drawing.FrameTypes,Tekla.Structures.Drawing.DrawingColors)
Creates a new frame instance with the specified frame type and color.
FrameType: The frame type to be used.
FrameColor: The frame color to be used.

Tekla.Structures.Drawing.Frame.#ctor(Tekla.Structures.Drawing.FrameTypes,Tekla.Structures.Drawing.TeklaDrawingColor)
Creates a new frame instance with the specified frame type and RGB color.
FrameType: The frame type to be used.
FrameColor: The frame RGB color to be used.

Tekla.Structures.Drawing.Frame.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Frame.Clone
Clones the object.
Returns: A copy of the object.